{
  "categories": [
    {
      "id": "daily",
      "name": "Daily Life",
      "nameArabic": "الحياة اليومية",
      "nameUrdu": "روزمرہ کی زندگی",
      "icon": "sun",
      "color": "#F59E0B",
      "order": 1
    },
    {
      "id": "sleep",
      "name": "Sleep & Waking",
      "nameArabic": "النوم والاستيقاظ",
      "nameUrdu": "سونا اور جاگنا",
      "icon": "moon",
      "color": "#8B5CF6",
      "order": 2
    },
    {
      "id": "travel",
      "name": "Travel",
      "nameArabic": "السفر",
      "nameUrdu": "سفر",
      "icon": "car",
      "color": "#3B82F6",
      "order": 3
    },
    {
      "id": "food",
      "name": "Food & Drink",
      "nameArabic": "الطعام والشراب",
      "nameUrdu": "کھانا اور پینا",
      "icon": "utensils",
      "color": "#10B981",
      "order": 4
    },
    {
      "id": "anxiety",
      "name": "Anxiety & Distress",
      "nameArabic": "القلق والضيق",
      "nameUrdu": "پریشانی اور غم",
      "icon": "heart",
      "color": "#EF4444",
      "order": 5
    },
    {
      "id": "study",
      "name": "Study & Knowledge",
      "nameArabic": "الدراسة والعلم",
      "nameUrdu": "تعلیم اور علم",
      "icon": "book",
      "color": "#6366F1",
      "order": 6
    },
    {
      "id": "home",
      "name": "Home & Family",
      "nameArabic": "المنزل والعائلة",
      "nameUrdu": "گھر اور خاندان",
      "icon": "home",
      "color": "#EC4899",
      "order": 7
    },
    {
      "id": "gratitude",
      "name": "Gratitude & Praise",
      "nameArabic": "الشكر والحمد",
      "nameUrdu": "شکر اور حمد",
      "icon": "smile",
      "color": "#14B8A6",
      "order": 8
    },
   {
      "id": "prayer",
      "name": "Prayer",
      "nameArabic": "الصلاة",
      "nameUrdu": "نماز",
      "icon": "praying-hands", 
      "color": "#7C3AED",
      "order": 9
    },
    {
      "id": "protection",
      "name": "Protection",
      "nameArabic": "الحماية",
      "nameUrdu": "حفاظت",
      "icon": "shield-alt",     
      "color": "#DC2626",
      "order": 10
    },
    {
      "id": "health",
      "name": "Health & Wellness",
      "nameArabic": "الصحة والعافية",
      "nameUrdu": "صحت اور تندرستی",
      "icon": "heartbeat",      
      "color": "#059669",
      "order": 11
    },
    {
      "id": "weather",
      "name": "Weather",
      "nameArabic": "الطقس",
      "nameUrdu": "موسم",
      "icon": "cloud",
      "color": "#0891B2",
      "order": 12
    }
  ],
  "duas": [
    {
      "id": "morning_001",
      "title": "Morning Remembrance - Complete",
      "titleArabic": "أذكار الصباح الكاملة",
      "titleUrdu": "صبح کا مکمل ذکر",
      "category": {
        "id": "daily",
        "name": "Daily Life"
      },
      "arabicText": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      "transliteration": "Asbahna wa asbahal-mulku lillah, walhamdu lillah, la ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamdu wa huwa 'ala kulli shay'in qadir, Rabbi as'aluka khayra ma fi hadhal-yawmi wa khayra ma ba'dahu, wa a'udhu bika min sharri ma fi hadhal-yawmi wa sharri ma ba'dahu, Rabbi a'udhu bika minal-kasali wa su'il-kibari, Rabbi a'udhu bika min 'adhabin fin-nari wa 'adhabin fil-qabr",
      "translation": "We have entered morning and the dominion belongs to Allah, and praise is to Allah. None has the right to be worshipped but Allah alone, Who has no partner. To Him belongs the dominion and to Him belongs all praise, and He has power over everything. My Lord, I ask You for the good of this day and the good of what follows it, and I seek refuge in You from the evil of this day and the evil of what follows it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of the Fire and the punishment of the grave",
      "translationUrdu": "ہم نے صبح کی اور بادشاہت اللہ کے لیے ہے، اور تمام تعریفیں اللہ کے لیے ہیں۔ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں۔ اسی کے لیے بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں اور وہ ہر چیز پر قادر ہے۔ اے میرے رب! میں تجھ سے اس دن کی بھلائی اور اس کے بعد کی بھلائی مانگتا ہوں، اور میں تیری پناہ چاہتا ہوں اس دن کی برائی سے اور اس کے بعد کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں سستی اور بڑھاپے کی برائی سے۔ اے میرے رب! میں تیری پناہ چاہتا ہوں آگ کے عذاب سے اور قبر کے عذاب سے",
      "reference": {
        "source": "hadith",
        "book": "Muslim",
        "hadithNumber": "2723",
        "authenticity": "sahih"
      },
      "tags": ["morning", "daily", "remembrance"],
      "searchKeywords": ["morning", "wake up", "start day", "صباح", "صبح"]
    },
    {
      "id": "sleep_001",
      "title": "Before Sleeping - Correct",
      "titleArabic": "دعاء النوم الصحيح",
      "titleUrdu": "سونے سے پہلے کی صحیح دعا",
      "category": {
        "id": "sleep",
        "name": "Sleep & Waking"
      },
      "arabicText": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
      "transliteration": "Bismika Rabbi wada'tu janbi, wa bika arfa'uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfadh-ha bima tahfadhu bihi 'ibadakas-salihin",
      "translation": "In Your name my Lord, I lie down and in Your name I rise, so if You should take my soul then have mercy upon it, and if You should return my soul then protect it in the manner You do so with Your righteous servants",
      "translationUrdu": "اے میرے رب! تیرے نام سے میں نے اپنا پہلو رکھا اور تیرے نام سے ہی اسے اٹھاؤں گا۔ اگر تو میری روح قبض کر لے تو اس پر رحم فرما، اور اگر اسے چھوڑ دے تو اس کی حفاظت فرما جیسے تو اپنے نیک بندوں کی حفاظت کرتا ہے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "6320",
        "authenticity": "sahih"
      },
      "tags": ["sleep", "night", "rest"],
      "searchKeywords": ["sleep", "going to bed", "night", "نوم", "سونا"]
    },
    {
      "id": "sleep_002",
      "title": "Ayatul Kursi Before Sleep",
      "titleArabic": "آية الكرسي قبل النوم",
      "titleUrdu": "سونے سے پہلے آیت الکرسی",
      "category": {
        "id": "sleep",
        "name": "Sleep & Waking"
      },
      "arabicText": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "transliteration": "Allahu la ilaha illa Huwal-Hayyul-Qayyum, la ta'khudhuhu sinatun wa la nawm, lahu ma fis-samawati wa ma fil-ard, man dhal-ladhi yashfa'u 'indahu illa bi-idhnih, ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bishay'in min 'ilmihi illa bima sha'a, wasi'a kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma, wa Huwal-'Aliyyul-'Adhim",
      "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great",
      "translationUrdu": "اللہ، اس کے سوا کوئی معبود نہیں، زندہ ہے، قائم رہنے والا ہے۔ اسے نہ اونگھ آتی ہے اور نہ نیند۔ جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے سب اسی کا ہے۔ کون ہے جو اس کے حضور اس کی اجازت کے بغیر سفارش کر سکے؟ وہ جانتا ہے جو کچھ ان کے سامنے ہے اور جو کچھ ان کے پیچھے ہے، اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے مگر جتنا وہ چاہے۔ اس کی کرسی آسمانوں اور زمین کو وسعت میں لیے ہوئے ہے، اور ان کی حفاظت اسے تھکاتی نہیں۔ اور وہی بلند و برتر ہے، عظمت والا ہے",
      "reference": {
        "source": "quran",
        "chapter": "Al-Baqarah",
        "verse": "2:255"
      },
      "benefits": "Prophet ﷺ said: Whoever recites Ayatul Kursi when going to bed, Allah will send a guardian to protect them and Satan will not approach until morning",
      "benefitsUrdu": "نبی ﷺ نے فرمایا: جو شخص سوتے وقت آیت الکرسی پڑھے گا، اللہ اس کے لیے ایک نگہبان بھیجے گا اور شیطان صبح تک اس کے قریب نہیں آئے گا",
      "tags": ["sleep", "protection", "night", "ayatul kursi"],
      "searchKeywords": ["ayatul kursi", "sleep protection", "آیت الکرسی", "نیند"]
    },
    {
      "id": "wakeup_001",
      "title": "Upon Waking Up",
      "titleArabic": "دعاء الاستيقاظ",
      "titleUrdu": "بیدار ہونے پر دعا",
      "category": {
        "id": "sleep",
        "name": "Sleep & Waking"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
      "transliteration": "Alhamdu lillahil-ladhi ahyana ba'da ma amatana wa ilayhin-nushur",
      "translation": "All praise is to Allah who gave us life after causing us to die, and to Him is the resurrection",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں موت کے بعد زندگی عطا کی اور اسی کی طرف اٹھنا ہے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "6312",
        "authenticity": "sahih"
      },
      "tags": ["waking", "morning", "gratitude"],
      "searchKeywords": ["wake up", "waking", "morning", "استيقاظ", "بیداری"]
    },
    {
      "id": "travel_001",
      "title": "When Starting a Journey",
      "titleArabic": "دعاء السفر",
      "titleUrdu": "سفر شروع کرتے وقت کی دعا",
      "category": {
        "id": "travel",
        "name": "Travel"
      },
      "arabicText": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
      "transliteration": "Subhanal-ladhi sakhkhara lana hadha wa ma kunna lahu muqrinin, wa inna ila rabbina lamunqalibun",
      "translation": "Glory be to Him Who has subjected this to us, and we could never have it by our efforts. Surely, unto our Lord we are to return",
      "translationUrdu": "پاک ہے وہ ذات جس نے اس کو ہمارے لیے مسخر کر دیا اور ہم اس کی طاقت نہیں رکھتے تھے، اور بے شک ہم اپنے رب کی طرف لوٹنے والے ہیں",
      "reference": {
        "source": "quran",
        "chapter": "Az-Zukhruf",
        "verse": "43:13-14"
      },
      "tags": ["travel", "journey", "safety"],
      "searchKeywords": ["travel", "journey", "trip", "car", "flight", "سفر"]
    },
    {
      "id": "travel_002",
      "title": "Full Travel Dua",
      "titleArabic": "دعاء السفر الكامل",
      "titleUrdu": "سفر کی مکمل دعا",
      "category": {
        "id": "travel",
        "name": "Travel"
      },
      "arabicText": "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ",
      "transliteration": "Allahu Akbar, Allahu Akbar, Allahu Akbar, Subhanal-ladhi sakhkhara lana hadha wa ma kunna lahu muqrinin, wa inna ila rabbina lamunqalibun. Allahumma inna nas'aluka fi safarina hadhal-birra wat-taqwa, wa minal-'amali ma tarda. Allahumma hawwin 'alayna safarana hadha, watwi 'anna bu'dahu. Allahumma antas-sahibu fis-safari, wal-khalifatu fil-ahli. Allahumma inni a'udhu bika min wa'tha'is-safari, wa ka'abatil-mandhwari, wa su'il-munqalabi fil-mali wal-ahli",
      "translation": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. Glory be to Him Who has subjected this to us, and we could never have it by our efforts. Surely, unto our Lord we are to return. O Allah, we ask You on this our journey for goodness and piety, and for works that are pleasing to You. O Allah, make easy for us this journey of ours and make short its length for us. O Allah, You are our Companion on the road and the Guardian of our family. O Allah, I seek refuge in You from the difficulties of travel, from having a change of heart and being in a bad predicament, and I take refuge in You from an ill fated outcome for our wealth and family",
      "translationUrdu": "اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے۔ پاک ہے وہ ذات جس نے اس کو ہمارے لیے مسخر کر دیا اور ہم اس کی طاقت نہیں رکھتے تھے، اور بے شک ہم اپنے رب کی طرف لوٹنے والے ہیں۔ اے اللہ! ہم تجھ سے اس سفر میں نیکی اور تقویٰ مانگتے ہیں اور ایسے اعمال جن سے تو راضی ہو۔ اے اللہ! ہمارے لیے اس سفر کو آسان کر دے اور اس کی دوری کو ہمارے لیے سمیٹ دے۔ اے اللہ! تو ہی سفر میں ساتھی ہے اور گھر والوں میں نگہبان ہے۔ اے اللہ! میں تیری پناہ چاہتا ہوں سفر کی مشقت سے، غمگین منظر سے، اور مال و اہل میں برے انجام سے",
      "reference": {
        "source": "hadith",
        "book": "Muslim",
        "hadithNumber": "1342",
        "authenticity": "sahih"
      },
      "tags": ["travel", "journey", "complete", "protection"],
      "searchKeywords": ["travel dua", "complete travel", "long journey", "سفر مکمل"]
    },
    {
      "id": "food_001",
      "title": "Before Eating",
      "titleArabic": "دعاء قبل الطعام",
      "titleUrdu": "کھانے سے پہلے کی دعا",
      "category": {
        "id": "food",
        "name": "Food & Drink"
      },
      "arabicText": "بِسْمِ اللَّهِ",
      "transliteration": "Bismillah",
      "translation": "In the name of Allah",
      "translationUrdu": "اللہ کے نام سے",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "3767",
        "authenticity": "sahih"
      },
      "additionalNote": "If you forget to say Bismillah at the beginning, say: Bismillahi awwalahu wa akhirahu (In the name of Allah at its beginning and at its end)",
      "additionalNoteUrdu": "اگر شروع میں بسم اللہ کہنا بھول جائیں تو کہیں: بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ (اللہ کے نام سے اس کے شروع میں اور اس کے آخر میں)",
      "tags": ["food", "eating", "meal"],
      "searchKeywords": ["eat", "food", "meal", "hungry", "طعام", "کھانا"]
    },
    {
      "id": "food_002",
      "title": "After Eating",
      "titleArabic": "دعاء بعد الطعام",
      "titleUrdu": "کھانے کے بعد کی دعا",
      "category": {
        "id": "food",
        "name": "Food & Drink"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
      "transliteration": "Alhamdu lillahil-ladhi at'amani hadha, wa razaqanihi min ghayri hawlin minni wa la quwwah",
      "translation": "All praise is to Allah Who fed me this and provided it for me without any might nor power from myself",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں جس نے مجھے یہ کھلایا اور مجھے یہ رزق دیا میری کسی طاقت اور قوت کے بغیر",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "4023",
        "authenticity": "hasan"
      },
      "tags": ["food", "gratitude", "meal"],
      "searchKeywords": ["finish eating", "after meal", "بعد الطعام", "کھانے کے بعد"]
    },
    {
      "id": "food_003",
      "title": "Before Drinking",
      "titleArabic": "دعاء قبل الشرب",
      "titleUrdu": "پینے سے پہلے کی دعا",
      "category": {
        "id": "food",
        "name": "Food & Drink"
      },
      "arabicText": "بِسْمِ اللَّهِ",
      "transliteration": "Bismillah",
      "translation": "In the name of Allah",
      "translationUrdu": "اللہ کے نام سے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari & Muslim",
        "authenticity": "sahih"
      },
      "tags": ["drink", "water", "beverage"],
      "searchKeywords": ["drink", "water", "thirsty", "پینا", "پانی"]
    },
    {
      "id": "food_004",
      "title": "After Drinking",
      "titleArabic": "دعاء بعد الشرب",
      "titleUrdu": "پینے کے بعد کی دعا",
      "category": {
        "id": "food",
        "name": "Food & Drink"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ",
      "transliteration": "Alhamdu lillah",
      "translation": "All praise is to Allah",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں",
      "reference": {
        "source": "hadith",
        "authenticity": "sahih"
      },
      "tags": ["drink", "gratitude"],
      "searchKeywords": ["after drinking", "finish drink", "پینے کے بعد"]
    },
    {
      "id": "food_005",
      "title": "After Drinking Milk",
      "titleArabic": "دعاء بعد شرب اللبن",
      "titleUrdu": "دودھ پینے کے بعد کی دعا",
      "category": {
        "id": "food",
        "name": "Food & Drink"
      },
      "arabicText": "اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
      "transliteration": "Allahumma barik lana fihi wa zidna minhu",
      "translation": "O Allah, bless it for us and increase us from it",
      "translationUrdu": "اے اللہ! ہمارے لیے اس میں برکت دے اور ہمیں اس سے زیادہ عطا فرما",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "3730",
        "authenticity": "sahih"
      },
      "tags": ["milk", "drink", "blessing"],
      "searchKeywords": ["milk", "dairy", "دودھ"]
    },
    {
      "id": "anxiety_001",
      "title": "For Anxiety and Sorrow",
      "titleArabic": "دعاء الهم والحزن",
      "titleUrdu": "غم اور پریشانی کی دعا",
      "category": {
        "id": "anxiety",
        "name": "Anxiety & Distress"
      },
      "arabicText": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي وَنُورَ صَدْرِي وَجَلَاءَ حُزْنِي وَذَهَابَ هَمِّي",
      "transliteration": "Allahumma inni 'abduka, ibnu 'abdika, ibnu amatika, nasiyati biyadika, madin fiyya hukmuka, 'adlun fiyya qada'uka, as'aluka bikulli ismin huwa laka sammayta bihi nafsaka aw anzaltahu fi kitabika aw 'allamtahu ahadan min khalqika awista'tharta bihi fi 'ilmil-ghaybi 'indaka an taj'alal-Qur'ana rabi'a qalbi wa nura sadri wa jala'a huzni wa dhahaba hammi",
      "translation": "O Allah, I am Your servant, son of Your servant, son of Your maidservant. My forelock is in Your hand. Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You have named Yourself with, or revealed in Your Book, or taught to any of Your creation, or preserved in the knowledge of the Unseen with You, that You make the Quran the life of my heart and the light of my breast, and a departure for my sorrow and a release for my anxiety",
      "translationUrdu": "اے اللہ! میں تیرا بندہ ہوں، تیرے بندے کا بیٹا ہوں، تیری بندی کا بیٹا ہوں۔ میری پیشانی تیرے ہاتھ میں ہے۔ میرے بارے میں تیرا حکم نافذ ہے، میرے بارے میں تیرا فیصلہ عدل ہے۔ میں تجھ سے سوال کرتا ہوں تیرے ہر اس نام کے واسطے سے جو تیرا ہے، جس سے تو نے اپنے آپ کو نام دیا، یا اپنی کتاب میں نازل کیا، یا اپنی مخلوق میں سے کسی کو سکھایا، یا اپنے علم غیب میں محفوظ رکھا، کہ تو قرآن کو میرے دل کی بہار، میرے سینے کا نور، میرے غم کا خاتمہ، اور میری پریشانی کا زوال بنا دے",
      "reference": {
        "source": "hadith",
        "book": "Ahmad",
        "hadithNumber": "3712",
        "authenticity": "sahih"
      },
      "tags": ["anxiety", "worry", "distress", "sadness"],
      "searchKeywords": ["anxious", "worried", "sad", "distressed", "depression", "قلق", "پریشانی"]
    },
    {
      "id": "anxiety_002",
      "title": "For Relief from Distress",
      "titleArabic": "دعاء الكرب",
      "titleUrdu": "تکلیف سے نجات کی دعا",
      "category": {
        "id": "anxiety",
        "name": "Anxiety & Distress"
      },
      "arabicText": "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ",
      "transliteration": "La ilaha illallahul-'Adhimul-Halim, la ilaha illallahu Rabbul-'Arshil-'Adhim, la ilaha illallahu Rabbus-samawati wa Rabbul-ardi wa Rabbul-'Arshil-Karim",
      "translation": "None has the right to be worshipped but Allah, the Magnificent, the Forbearing. None has the right to be worshipped but Allah, Lord of the Magnificent Throne. None has the right to be worshipped but Allah, Lord of the heavens and Lord of the earth, and Lord of the Noble Throne",
      "translationUrdu": "اللہ کے سوا کوئی معبود نہیں، عظمت والا، بردبار۔ اللہ کے سوا کوئی معبود نہیں، عظیم عرش کا رب۔ اللہ کے سوا کوئی معبود نہیں، آسمانوں کا رب، زمین کا رب، اور عرش کریم کا رب",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "6345",
        "authenticity": "sahih"
      },
      "tags": ["distress", "difficulty", "hardship"],
      "searchKeywords": ["distress", "difficulty", "hardship", "problem", "کرب", "تکلیف"]
    },
    {
      "id": "anxiety_003",
      "title": "Simple Dua for Anxiety",
      "titleArabic": "دعاء بسيط للقلق",
      "titleUrdu": "پریشانی کی آسان دعا",
      "category": {
        "id": "anxiety",
        "name": "Anxiety & Distress"
      },
      "arabicText": "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "transliteration": "Hasbiyallahu la ilaha illa Huwa 'alayhi tawakkaltu wa Huwa Rabbul-'Arshil-'Adhim",
      "translation": "Allah is sufficient for me. There is none worthy of worship but Him. I have placed my trust in Him and He is Lord of the Magnificent Throne",
      "translationUrdu": "اللہ میرے لیے کافی ہے، اس کے سوا کوئی معبود نہیں، میں نے اسی پر بھروسہ کیا اور وہ عرش عظیم کا رب ہے",
      "reference": {
        "source": "quran",
        "chapter": "At-Tawbah",
        "verse": "9:129"
      },
      "benefits": "Recite 7 times in the morning and evening",
      "benefitsUrdu": "صبح و شام سات بار پڑھیں",
      "tags": ["anxiety", "trust", "tawakkul"],
      "searchKeywords": ["hasbunallah", "trust Allah", "anxiety relief", "حسبی اللہ"]
    },
    {
      "id": "study_001",
      "title": "For Knowledge and Understanding",
      "titleArabic": "دعاء طلب العلم",
      "titleUrdu": "علم اور سمجھ کی دعا",
      "category": {
        "id": "study",
        "name": "Study & Knowledge"
      },
      "arabicText": "رَبِّ زِدْنِي عِلْمًا",
      "transliteration": "Rabbi zidni 'ilma",
      "translation": "My Lord, increase me in knowledge",
      "translationUrdu": "اے میرے رب! مجھے علم میں اضافہ عطا فرما",
      "reference": {
        "source": "quran",
        "chapter": "Taha",
        "verse": "20:114"
      },
      "tags": ["study", "knowledge", "learning"],
      "searchKeywords": ["study", "exam", "test", "learn", "knowledge", "دراسة", "علم"]
    },
    {
      "id": "study_002",
      "title": "Before Starting Studies",
      "titleArabic": "دعاء قبل بدء الدراسة",
      "titleUrdu": "پڑھائی شروع کرنے سے پہلے کی دعا",
      "category": {
        "id": "study",
        "name": "Study & Knowledge"
      },
      "arabicText": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا",
      "transliteration": "Allahumma anfa'ni bima 'allamtani, wa 'allimni ma yanfa'uni, wa zidni 'ilma",
      "translation": "O Allah, benefit me with what You have taught me, and teach me that which will benefit me, and increase me in knowledge",
      "translationUrdu": "اے اللہ! مجھے نفع دے اس سے جو تو نے مجھے سکھایا، اور مجھے وہ سکھا جو مجھے فائدہ دے، اور میرا علم بڑھا",
      "reference": {
        "source": "hadith",
        "book": "Ibn Majah",
        "hadithNumber": "251",
        "authenticity": "hasan"
      },
      "tags": ["study", "learning", "beneficial knowledge"],
      "searchKeywords": ["before study", "learning", "پڑھائی شروع"]
    },
    {
      "id": "study_003",
      "title": "Before Exam",
      "titleArabic": "دعاء قبل الامتحان",
      "titleUrdu": "امتحان سے پہلے کی دعا",
      "category": {
        "id": "study",
        "name": "Study & Knowledge"
      },
      "arabicText": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
      "transliteration": "Allahumma la sahla illa ma ja'altahu sahla, wa anta taj'alul-hazna idha shi'ta sahla",
      "translation": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty, if You wish, easy",
      "translationUrdu": "اے اللہ! کوئی چیز آسان نہیں مگر وہ جسے تو نے آسان کر دیا، اور تو مشکل کو بھی اگر چاہے تو آسان کر دیتا ہے",
      "reference": {
        "source": "hadith",
        "book": "Ibn Hibban",
        "hadithNumber": "2427",
        "authenticity": "sahih"
      },
      "tags": ["exam", "test", "difficulty"],
      "searchKeywords": ["exam", "test", "quiz", "examination", "امتحان"]
    },
    {
      "id": "home_001",
      "title": "Entering the Home",
      "titleArabic": "دعاء دخول المنزل",
      "titleUrdu": "گھر میں داخل ہوتے وقت کی دعا",
      "category": {
        "id": "home",
        "name": "Home & Family"
      },
      "arabicText": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا",
      "transliteration": "Bismillahi walajna, wa bismillahi kharajna, wa 'alallahi rabbina tawakkalna",
      "translation": "In the name of Allah we enter, and in the name of Allah we leave, and upon Allah our Lord we depend",
      "translationUrdu": "اللہ کے نام سے ہم داخل ہوئے، اللہ کے نام سے ہم نکلے، اور اللہ ہمارے رب پر ہم نے بھروسہ کیا",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "5096",
        "authenticity": "sahih"
      },
      "tags": ["home", "entering", "family"],
      "searchKeywords": ["home", "house", "entering", "return home", "منزل", "گھر"]
    },
    {
      "id": "home_002",
      "title": "Leaving the Home",
      "titleArabic": "دعاء الخروج من المنزل",
      "titleUrdu": "گھر سے نکلتے وقت کی دعا",
      "category": {
        "id": "home",
        "name": "Home & Family"
      },
      "arabicText": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "transliteration": "Bismillahi, tawakkaltu 'alallahi, la hawla wa la quwwata illa billah",
      "translation": "In the name of Allah, I have placed my trust in Allah, there is no might and no power except by Allah",
      "translationUrdu": "اللہ کے نام سے، میں نے اللہ پر بھروسہ کیا، کوئی طاقت اور قوت نہیں مگر اللہ کی",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "5095",
        "authenticity": "sahih"
      },
      "benefits": "The Prophet ﷺ said: When someone says this, it will be said to him: You are guided, defended and protected. Satan will move away from him",
      "benefitsUrdu": "نبی ﷺ نے فرمایا: جب کوئی یہ کہے تو اس سے کہا جاتا ہے: تمہاری رہنمائی کر دی گئی، تمہاری حفاظت کر دی گئی، اور تمہیں بچا لیا گیا۔ شیطان اس سے دور ہو جاتا ہے",
      "tags": ["leaving", "going out", "protection"],
      "searchKeywords": ["leaving home", "going out", "exit", "خروج", "گھر سے نکلنا"]
    },
    {
      "id": "gratitude_001",
      "title": "General Praise",
      "titleArabic": "الحمد لله",
      "titleUrdu": "عام حمد",
      "category": {
        "id": "gratitude",
        "name": "Gratitude & Praise"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "transliteration": "Alhamdu lillahi rabbil-'alamin",
      "translation": "All praise is due to Allah, Lord of all the worlds",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے",
      "reference": {
        "source": "quran",
        "chapter": "Al-Fatihah",
        "verse": "1:2"
      },
      "tags": ["gratitude", "praise", "thankfulness"],
      "searchKeywords": ["thank", "grateful", "praise", "alhamdulillah", "شكر", "حمد"]
    },
    {
      "id": "gratitude_002",
      "title": "When Receiving Good News",
      "titleArabic": "دعاء عند سماع الخبر السار",
      "titleUrdu": "خوشخبری ملنے پر دعا",
      "category": {
        "id": "gratitude",
        "name": "Gratitude & Praise"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
      "transliteration": "Alhamdu lillahil-ladhi bi ni'matihi tatimmus-salihat",
      "translation": "All praise is due to Allah by Whose favor good works are accomplished",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں جس کی نعمت سے نیک کام پورے ہوتے ہیں",
      "reference": {
        "source": "hadith",
        "book": "Ibn Majah",
        "hadithNumber": "3803",
        "authenticity": "sahih"
      },
      "tags": ["good news", "gratitude", "success"],
      "searchKeywords": ["good news", "success", "achievement", "خبر سار", "کامیابی"]
    },
    {
      "id": "washroom_001",
      "title": "Entering the Washroom",
      "titleArabic": "دعاء دخول الخلاء",
      "titleUrdu": "بیت الخلاء میں داخل ہوتے وقت کی دعا",
      "category": {
        "id": "daily",
        "name": "Daily Life"
      },
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
      "transliteration": "Allahumma inni a'udhu bika minal-khubuthi wal-khaba'ith",
      "translation": "O Allah, I seek refuge in You from the male and female unclean spirits",
      "translationUrdu": "اے اللہ! میں تیری پناہ چاہتا ہوں نر اور مادہ شیاطین سے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "142",
        "authenticity": "sahih"
      },
      "tags": ["washroom", "bathroom", "toilet"],
      "searchKeywords": ["washroom", "bathroom", "toilet", "restroom", "حمام", "بیت الخلاء"]
    },
    {
      "id": "washroom_002",
      "title": "Leaving the Washroom",
      "titleArabic": "دعاء الخروج من الخلاء",
      "titleUrdu": "بیت الخلاء سے نکلتے وقت کی دعا",
      "category": {
        "id": "daily",
        "name": "Daily Life"
      },
      "arabicText": "غُفْرَانَكَ",
      "transliteration": "Ghufranaka",
      "translation": "I seek Your forgiveness",
      "translationUrdu": "میں تجھ سے بخشش چاہتا ہوں",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "30",
        "authenticity": "sahih"
      },
      "tags": ["washroom", "leaving", "cleanliness"],
      "searchKeywords": ["leaving washroom", "exit bathroom", "خروج حمام"]
    },
    {
      "id": "prayer_001",
      "title": "Adhan Response",
      "titleArabic": "الرد على الأذان",
      "titleUrdu": "اذان کا جواب",
      "category": {
        "id": "prayer",
        "name": "Prayer"
      },
      "arabicText": "يُكَرِّرُ مَا يَقُولُ الْمُؤَذِّنُ إِلَّا فِي الْحَيْعَلَةِ يَقُولُ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "transliteration": "Repeat what the muadhin says, except for Hayya 'alas-salah and Hayya 'alal-falah, say: La hawla wa la quwwata illa billah",
      "translation": "Repeat what the caller to prayer says, except when he says 'Come to prayer' and 'Come to success', say: There is no might and no power except by Allah",
      "translationUrdu": "مؤذن جو کہے اس کو دہرائیں، سوائے 'حی علی الصلوٰۃ' اور 'حی علی الفلاح' کے، ان کے جواب میں کہیں: لا حول ولا قوۃ الا باللہ",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "611",
        "authenticity": "sahih"
      },
      "tags": ["adhan", "prayer", "call to prayer"],
      "searchKeywords": ["adhan", "azan", "call to prayer", "اذان"]
    },
    {
      "id": "prayer_002",
      "title": "After Adhan",
      "titleArabic": "الدعاء بعد الأذان",
      "titleUrdu": "اذان کے بعد کی دعا",
      "category": {
        "id": "prayer",
        "name": "Prayer"
      },
      "arabicText": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
      "transliteration": "Allahumma Rabba hadhihid-da'watit-tammah, was-salatil-qa'imah, ati Muhammadanil-wasilata wal-fadilah, wab'ath-hu maqaman mahmudanil-ladhi wa'adtah",
      "translation": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the intercession and favor, and raise him to the praised station which You have promised him",
      "translationUrdu": "اے اللہ! اس کامل پکار اور قائم ہونے والی نماز کے رب، محمد ﷺ کو وسیلہ اور فضیلت عطا فرما، اور انہیں اس مقام محمود پر پہنچا جس کا تو نے ان سے وعدہ کیا ہے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "614",
        "authenticity": "sahih"
      },
      "benefits": "The Prophet ﷺ said: Whoever says this after the adhan, my intercession will be guaranteed for him on the Day of Resurrection",
      "benefitsUrdu": "نبی ﷺ نے فرمایا: جو شخص اذان کے بعد یہ کہے، قیامت کے دن میری شفاعت اس کے لیے واجب ہو جائے گی",
      "tags": ["adhan", "dua", "intercession"],
      "searchKeywords": ["after adhan", "prayer call", "اذان کے بعد"]
    },
    {
      "id": "prayer_003",
      "title": "Before Prayer (Opening Dua)",
      "titleArabic": "دعاء الاستفتاح",
      "titleUrdu": "دعائے استفتاح",
      "category": {
        "id": "prayer",
        "name": "Prayer"
      },
      "arabicText": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ",
      "transliteration": "Subhanaka Allahumma wa bihamdika, wa tabarakasmuka, wa ta'ala jadduka, wa la ilaha ghayruk",
      "translation": "Glory be to You O Allah, and praise. Blessed is Your Name and Exalted is Your Majesty. There is none worthy of worship but You",
      "translationUrdu": "اے اللہ! تو پاک ہے اور تیری حمد کے ساتھ، تیرا نام بابرکت ہے، تیری عظمت بلند ہے، اور تیرے سوا کوئی معبود نہیں",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "776",
        "authenticity": "sahih"
      },
      "tags": ["prayer", "salah", "opening"],
      "searchKeywords": ["prayer opening", "istiftah", "استفتاح", "نماز شروع"]
    },
    {
      "id": "prayer_004",
      "title": "After Tashahhud (Before Salam)",
      "titleArabic": "الدعاء قبل السلام",
      "titleUrdu": "سلام سے پہلے کی دعا",
      "category": {
        "id": "prayer",
        "name": "Prayer"
      },
      "arabicText": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
      "transliteration": "Allahumma inni a'udhu bika min 'adhabi Jahannama, wa min 'adhabil-qabri, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-Masihid-Dajjal",
      "translation": "O Allah, I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah",
      "translationUrdu": "اے اللہ! میں تیری پناہ چاہتا ہوں جہنم کے عذاب سے، قبر کے عذاب سے، زندگی اور موت کے فتنے سے، اور مسیح دجال کے فتنے کی برائی سے",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "1377",
        "authenticity": "sahih"
      },
      "tags": ["prayer", "tashahhud", "protection"],
      "searchKeywords": ["before salam", "tashahhud", "تشہد", "سلام سے پہلے"]
    },
    {
      "id": "protection_001",
      "title": "Morning & Evening Protection",
      "titleArabic": "أذكار الصباح والمساء للحماية",
      "titleUrdu": "صبح و شام کی حفاظت کا ذکر",
      "category": {
        "id": "protection",
        "name": "Protection"
      },
      "arabicText": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "transliteration": "Bismillahil-ladhi la yadurru ma'asmihi shay'un fil-ardi wa la fis-sama'i wa Huwas-Sami'ul-'Alim",
      "translation": "In the Name of Allah, Who with His Name nothing can cause harm in the earth nor in the heavens, and He is the All-Hearing, the All-Knowing",
      "translationUrdu": "اللہ کے نام سے، جس کے نام کے ساتھ زمین اور آسمان میں کوئی چیز نقصان نہیں پہنچا سکتی، اور وہ سننے والا، جاننے والا ہے",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "5088",
        "authenticity": "sahih"
      },
      "benefits": "Say 3 times in the morning and evening. The Prophet ﷺ said: Nothing will harm the one who says this three times",
      "benefitsUrdu": "صبح و شام تین بار کہیں۔ نبی ﷺ نے فرمایا: جو شخص یہ تین بار کہے اسے کوئی چیز نقصان نہیں پہنچا سکتی",
      "tags": ["protection", "morning", "evening"],
      "searchKeywords": ["protection", "safety", "morning evening", "حفاظت", "حمایت"]
    },
    {
      "id": "protection_002",
      "title": "Protection from Evil Eye",
      "titleArabic": "الحماية من العين",
      "titleUrdu": "نظر بد سے حفاظت",
      "category": {
        "id": "protection",
        "name": "Protection"
      },
      "arabicText": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      "transliteration": "A'udhu bikalimatillahit-tammati min sharri ma khalaq",
      "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created",
      "translationUrdu": "میں اللہ کے کامل کلمات کی پناہ چاہتا ہوں اس کی مخلوق کی برائی سے",
      "reference": {
        "source": "hadith",
        "book": "Muslim",
        "hadithNumber": "2708",
        "authenticity": "sahih"
      },
      "benefits": "Say 3 times in the morning and evening for protection",
      "benefitsUrdu": "حفاظت کے لیے صبح و شام تین بار کہیں",
      "tags": ["protection", "evil eye", "hasad"],
      "searchKeywords": ["evil eye", "nazar", "hasad", "نظر بد", "حسد"]
    },
    {
      "id": "protection_003",
      "title": "Last Two Verses of Surah Baqarah",
      "titleArabic": "آخر آيتين من سورة البقرة",
      "titleUrdu": "سورۃ البقرہ کی آخری دو آیات",
      "category": {
        "id": "protection",
        "name": "Protection"
      },
      "arabicText": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "transliteration": "Amanar-Rasulu bima unzila ilayhi mir-Rabbihi wal-mu'minun, kullun amana billahi wa mala'ikatihi wa kutubihi wa Rusulihi, la nufarriqu bayna ahadim-mir-Rusulihi, wa qalu sami'na wa ata'na ghufranaka Rabbana wa ilaykal-masir. La yukallifullahu nafsan illa wus'aha, laha ma kasabat wa 'alayha maktasabat, Rabbana la tu'akhidhna in nasina aw akhta'na, Rabbana wa la tahmil 'alayna isran kama hamaltahu 'alal-ladhina min qablina, Rabbana wa la tuhammilna ma la taqata lana bihi, wa'fu 'anna, waghfir lana, warhamma, Anta Mawlana fansurna 'alal-qawmil-kafirin",
      "translation": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' Allah does not burden a soul beyond its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. 'Our Lord, do not take us to task if we forget or make a mistake. Our Lord, and do not lay upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.'",
      "translationUrdu": "رسول ایمان لایا اس چیز پر جو اس کی طرف اس کے رب کی جانب سے نازل کی گئی اور مومنین بھی۔ سب ایمان لائے اللہ پر اور اس کے فرشتوں پر اور اس کی کتابوں پر اور اس کے رسولوں پر۔ ہم اس کے رسولوں میں سے کسی میں فرق نہیں کرتے۔ اور انہوں نے کہا ہم نے سنا اور اطاعت کی۔ اے ہمارے رب! ہم تیری بخشش چاہتے ہیں اور تیری ہی طرف لوٹنا ہے۔ اللہ کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا۔ اس کے لیے وہ ہے جو اس نے کمایا اور اس پر وہ ہے جو اس نے کمایا۔ اے ہمارے رب! ہم سے مواخذہ نہ کر اگر ہم بھول جائیں یا خطا کریں۔ اے ہمارے رب! ہم پر ایسا بوجھ نہ ڈال جیسا تو نے ہم سے پہلے لوگوں پر ڈالا تھا۔ اے ہمارے رب! ہم پر وہ بوجھ نہ ڈال جس کی ہمیں طاقت نہیں۔ اور ہمیں معاف فرما، اور ہمیں بخش دے، اور ہم پر رحم فرما۔ تو ہمارا مولیٰ ہے، پس کافروں کے خلاف ہماری مدد فرما",
      "reference": {
        "source": "quran",
        "chapter": "Al-Baqarah",
        "verse": "2:285-286"
      },
      "benefits": "The Prophet ﷺ said: Whoever recites these two verses at night, they will suffice him (from all evil)",
      "benefitsUrdu": "نبی ﷺ نے فرمایا: جو شخص رات کو یہ دو آیات پڑھے، وہ اس کے لیے کافی ہوں گی (ہر برائی سے)",
      "tags": ["protection", "night", "quran"],
      "searchKeywords": ["surah baqarah", "night protection", "سورۃ البقرہ", "رات کی حفاظت"]
    },
    {
      "id": "health_001",
      "title": "When Visiting the Sick",
      "titleArabic": "دعاء عيادة المريض",
      "titleUrdu": "مریض کی عیادت کی دعا",
      "category": {
        "id": "health",
        "name": "Health & Wellness"
      },
      "arabicText": "لَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ",
      "transliteration": "La ba'sa, tahurun in sha'Allah",
      "translation": "Do not worry, it will be a purification (for you), if Allah wills",
      "translationUrdu": "کوئی حرج نہیں، یہ پاکیزگی کا ذریعہ ہوگا، ان شاء اللہ",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "3616",
        "authenticity": "sahih"
      },
      "tags": ["health", "sick", "healing"],
      "searchKeywords": ["sick", "illness", "visiting sick", "مریض", "بیماری"]
    },
    {
      "id": "health_002",
      "title": "For Healing (Ruqyah)",
      "titleArabic": "الرقية الشرعية",
      "titleUrdu": "شرعی دم",
      "category": {
        "id": "health",
        "name": "Health & Wellness"
      },
      "arabicText": "بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ",
      "transliteration": "Bismillahi arqika, min kulli shay'in yu'dhika, min sharri kulli nafsin aw 'ayni hasidin Allahu yashfika, bismillahi arqika",
      "translation": "In the name of Allah I perform ruqyah for you, from everything that harms you, from the evil of every soul or envious eye, may Allah heal you, in the name of Allah I perform ruqyah for you",
      "translationUrdu": "اللہ کے نام سے میں تجھ پر دم کرتا ہوں، ہر اس چیز سے جو تجھے تکلیف دے، ہر نفس یا حسد کرنے والی نظر کی برائی سے، اللہ تجھے شفا دے، اللہ کے نام سے میں تجھ پر دم کرتا ہوں",
      "reference": {
        "source": "hadith",
        "book": "Muslim",
        "hadithNumber": "2186",
        "authenticity": "sahih"
      },
      "tags": ["healing", "ruqyah", "health"],
      "searchKeywords": ["ruqyah", "healing", "cure", "دم", "شفا"]
    },
    {
      "id": "health_003",
      "title": "When Feeling Pain",
      "titleArabic": "دعاء الألم",
      "titleUrdu": "درد کی دعا",
      "category": {
        "id": "health",
        "name": "Health & Wellness"
      },
      "arabicText": "ضع يدك على الذي تألم من جسدك وقل: بِسْمِ اللَّهِ ثَلاَثًا، وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
      "transliteration": "Place your hand on the part that hurts and say: Bismillah (3 times), then say 7 times: A'udhu billahi wa qudratihi min sharri ma ajidu wa uhadhir",
      "translation": "Place your hand on the part that hurts and say: In the name of Allah (3 times), then say 7 times: I seek refuge in Allah and in His Power from the evil of what I find and what I fear",
      "translationUrdu": "اپنا ہاتھ درد والی جگہ پر رکھیں اور کہیں: بسم اللہ (3 بار)، پھر 7 بار کہیں: میں اللہ اور اس کی قدرت کی پناہ چاہتا ہوں اس برائی سے جو میں محسوس کرتا ہوں اور جس سے ڈرتا ہوں",
      "reference": {
        "source": "hadith",
        "book": "Muslim",
        "hadithNumber": "2202",
        "authenticity": "sahih"
      },
      "tags": ["pain", "health", "healing"],
      "searchKeywords": ["pain", "ache", "hurt", "درد", "تکلیف"]
    },
    {
      "id": "weather_001",
      "title": "When It Rains",
      "titleArabic": "دعاء نزول المطر",
      "titleUrdu": "بارش کے وقت کی دعا",
      "category": {
        "id": "weather",
        "name": "Weather"
      },
      "arabicText": "اللَّهُمَّ صَيِّبًا نَافِعًا",
      "transliteration": "Allahumma sayyiban nafi'a",
      "translation": "O Allah, (make it) a beneficial rain",
      "translationUrdu": "اے اللہ! فائدہ مند بارش نازل فرما",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "1032",
        "authenticity": "sahih"
      },
      "tags": ["rain", "weather", "blessing"],
      "searchKeywords": ["rain", "weather", "بارش", "مطر"]
    },
    {
      "id": "weather_002",
      "title": "After Rain",
      "titleArabic": "دعاء بعد المطر",
      "titleUrdu": "بارش کے بعد کی دعا",
      "category": {
        "id": "weather",
        "name": "Weather"
      },
      "arabicText": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
      "transliteration": "Muturna bifadlillahi wa rahmatihi",
      "translation": "It has rained upon us through the bounty of Allah and His mercy",
      "translationUrdu": "ہم پر اللہ کے فضل اور اس کی رحمت سے بارش ہوئی",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "846",
        "authenticity": "sahih"
      },
      "tags": ["rain", "gratitude", "weather"],
      "searchKeywords": ["after rain", "rain stopped", "بارش کے بعد"]
    },
    {
      "id": "weather_003",
      "title": "When Hearing Thunder",
      "titleArabic": "دعاء الرعد",
      "titleUrdu": "گرج سنتے وقت کی دعا",
      "category": {
        "id": "weather",
        "name": "Weather"
      },
      "arabicText": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكَةُ مِنْ خِيفَتِهِ",
      "transliteration": "Subhanal-ladhi yusabbihur-ra'du bihamdihi wal-mala'ikatu min khifatih",
      "translation": "Glory be to Him Whom the thunder glorifies with His praise, and the angels (glorify Him) out of fear of Him",
      "translationUrdu": "پاک ہے وہ ذات جس کی تسبیح گرج اس کی حمد کے ساتھ کرتی ہے اور فرشتے اس کے خوف سے",
      "reference": {
        "source": "hadith",
        "book": "Al-Adab al-Mufrad",
        "hadithNumber": "723",
        "authenticity": "sahih"
      },
      "tags": ["thunder", "weather", "praise"],
      "searchKeywords": ["thunder", "lightning", "storm", "گرج", "بجلی"]
    },
    {
      "id": "weather_004",
      "title": "Seeking Rain",
      "titleArabic": "دعاء الاستسقاء",
      "titleUrdu": "بارش طلب کرنے کی دعا",
      "category": {
        "id": "weather",
        "name": "Weather"
      },
      "arabicText": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
      "transliteration": "Allahumma aghithna, Allahumma aghithna, Allahumma aghithna",
      "translation": "O Allah, send us rain. O Allah, send us rain. O Allah, send us rain",
      "translationUrdu": "اے اللہ! ہم پر بارش نازل فرما۔ اے اللہ! ہم پر بارش نازل فرما۔ اے اللہ! ہم پر بارش نازل فرما",
      "reference": {
        "source": "hadith",
        "book": "Bukhari",
        "hadithNumber": "1014",
        "authenticity": "sahih"
      },
      "tags": ["rain", "drought", "istisqa"],
      "searchKeywords": ["drought", "need rain", "استسقاء", "خشک سالی"]
    },
    {
      "id": "daily_002",
      "title": "When Looking in the Mirror",
      "titleArabic": "دعاء النظر في المرآة",
      "titleUrdu": "آئینے میں دیکھتے وقت کی دعا",
      "category": {
        "id": "daily",
        "name": "Daily Life"
      },
      "arabicText": "اللَّهُمَّ أَنْتَ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
      "transliteration": "Allahumma anta hassanta khalqi fahassin khuluqi",
      "translation": "O Allah, just as You have made my external features beautiful, make my character beautiful as well",
      "translationUrdu": "اے اللہ! جیسے تو نے میری صورت اچھی بنائی ہے، ویسے ہی میری سیرت بھی اچھی بنا دے",
      "reference": {
        "source": "hadith",
        "book": "Ahmad",
        "hadithNumber": "24049",
        "authenticity": "sahih"
      },
      "tags": ["mirror", "character", "daily"],
      "searchKeywords": ["mirror", "looking", "reflection", "آئینہ"]
    },
    {
      "id": "daily_003",
      "title": "When Wearing New Clothes",
      "titleArabic": "دعاء لبس الجديد",
      "titleUrdu": "نیا کپڑا پہننے کی دعا",
      "category": {
        "id": "daily",
        "name": "Daily Life"
      },
      "arabicText": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ",
      "transliteration": "Alhamdu lillahil-ladhi kasani hadha wa razaqanihi min ghayri hawlin minni wa la quwwah",
      "translation": "All praise is to Allah Who has clothed me with this and provided it for me without any might or power from myself",
      "translationUrdu": "تمام تعریفیں اللہ کے لیے ہیں جس نے مجھے یہ پہنایا اور مجھے یہ میری کسی طاقت اور قوت کے بغیر عطا فرمایا",
      "reference": {
        "source": "hadith",
        "book": "Abu Dawud",
        "hadithNumber": "4023",
        "authenticity": "hasan"
      },
      "benefits": "The Prophet ﷺ said: Whoever wears new clothes and says this, his past and future sins will be forgiven",
      "benefitsUrdu": "نبی ﷺ نے فرمایا: جو شخص نیا کپڑا پہنے اور یہ کہے، اس کے اگلے پچھلے گناہ معاف کر دیے جائیں گے",
      "tags": ["clothes", "new", "gratitude"],
      "searchKeywords": ["new clothes", "wearing", "dress", "نیا کپڑا"]
    }
  ]
}